{
  "products": [
    {
      "name": "iPhone 13",
      "type": "mobile",
      "storage": "128GB",
      "color": "blue",
      "img": "images/iphone13_blue.png",
      "description": "The iPhone 13 has a flat chassis analogous to that of contemporaneous Apple products, some differences such as the rear cameras being larger and arranged diagonally. The Face ID True Depth sensor housing on the iPhone is 20% smaller yet taller than its predecessors.",
      "price": "799",
      "id": 1
    },
    {
      "name": "iPhone 14",
      "type": "mobile",
      "storage": "512GB",
      "color": "violet",
      "description": "The iPhone 14 has a flat chassis analogous to that of contemporaneous Apple products, some differences such as the rear cameras being larger and arranged diagonally. The Face ID True Depth sensor housing on the iPhone is 20% smaller yet taller than its predecessors.",
      "img": "images/iphone14_violet.png",
      "price": "1199",
      "id": 2
    },
    {
      "name": "iPhone 14 Plus",
      "type": "mobile",
      "storage": "128GB",
      "color": "black",
      "description": "The iPhone 14 Plus has a flat chassis analogous to that of contemporaneous Apple products, some differences such as the rear cameras being larger and arranged diagonally. The Face ID True Depth sensor housing on the iPhone is 20% smaller yet taller than its predecessors.",
      "img": "images/iphone14plus_black.png",
      "price": "999",
      "id": 3
    },
    {
      "name": "iPhone 15",
      "type": "mobile",
      "storage": "256GB",
      "color": "green",
      "img": "images/iphone15_green.png",
      "description": "The iPhone 15 has a flat chassis analogous to that of contemporaneous Apple products, some differences such as the rear cameras being larger and arranged diagonally. The Face ID True Depth sensor housing on the iPhone is 20% smaller yet taller than its predecessors.",
      "price": "1100",
      "id": 4
    },
    {
      "name": "iPhone 15 Pro",
      "type": "mobile",
      "storage": "1TB",
      "color": "natural titan",
      "img": "images/iphone15pro_natural_titan.png",
      "description": "The iPhone 15 Pro has a flat chassis analogous to that of contemporaneous Apple products, some differences such as the rear cameras being larger and arranged diagonally. The Face ID True Depth sensor housing on the iPhone is 20% smaller yet taller than its predecessors.",
      "price": "1900",
      "id": 5
    },
    {
      "name": "iPhone 15 Pro Max",
      "type": "mobile",
      "storage": "512GB",
      "color": "blue titan",
      "img": "images/iphone15promax_blue_titan.png",
      "description": "The iPhone 15 Pro Max has a flat chassis analogous to that of contemporaneous Apple products, some differences such as the rear cameras being larger and arranged diagonally. The Face ID True Depth sensor housing on the iPhone is 20% smaller yet taller than its predecessors.",
      "price": "1800",
      "id": 6
    },
    {
      "name": "Macbook Pro M2 Max",
      "type": "mac",
      "ram": "16GB",
      "storage": "512GB",
      "screen": "16 inch",
      "color": "gray",
      "img": "images/macpro_m2max.png",
      "description": "The Macbook Pro M2 Max has a flat chassis analogous to that of contemporaneous Apple products, some differences such as the rear cameras being larger and arranged diagonally. The Face ID True Depth sensor housing on the iPhone is 20% smaller yet taller than its predecessors.",
      "price": "3299",
      "id": 7
    },
    {
      "name": "Macbook Air M1",
      "type": "mac",
      "ram": "8GB",
      "storage": "256GB",
      "screen": "13 inch",
      "color": "silver",
      "img": "images/macair_m1.png",
      "description": "The Macbook Air M1 has a flat chassis analogous to that of contemporaneous Apple products, some differences such as the rear cameras being larger and arranged diagonally. The Face ID True Depth sensor housing on the iPhone is 20% smaller yet taller than its predecessors",
      "price": "799",
      "id": 8
    },
    {
      "name": "iPad Air 5 M1",
      "type": "ipad",
      "ram": "8GB",
      "storage": "256GB",
      "screen": "10.9 inch",
      "color": "blue",
      "img": "images/ipadair5_m1blue.png",
      "description": "The  iPad Air 5 M1 has a flat chassis analogous to that of contemporaneous Apple products, some differences such as the rear cameras being larger and arranged diagonally. The Face ID True Depth sensor housing on the iPhone is 20% smaller yet taller than its predecessors",
      "price": "599",
      "id": 9
    },
    {
      "name": "iPad Pro M1",
      "type": "ipad",
      "ram": "16GB",
      "storage": "2TB",
      "screen": "11 inches",
      "color": "silver",
      "img": "images/ipadpro_m1silver.png",
      "description": "The  iPad Pro M1 has a flat chassis analogous to that of contemporaneous Apple products, some differences such as the rear cameras being larger and arranged diagonally. The Face ID True Depth sensor housing on the iPhone is 20% smaller yet taller than its predecessors",
      "price": "1899",
      "id": 10
    }
  ],
  "accounts": [
    {
      "name": "Thanh",
      "email": "test@email.com",
      "password": "test",
      "id": 1
    },
    {
      "name": "Ngô Văn Thành",
      "email": "thanh@email.com",
      "password": "thanh",
      "id": 2
    }
  ],
  "comments": [
    {
      "title": "good product",
      "comment": "very good",
      "date": "27-10-2023 22:42:56",
      "product_id": 1,
      "id": 1
    }
  ]
}